{
  "saint-jozef-bilczewski": {
    "name": "Saint Józef Bilczewski",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/2/21/J%C3%B3zef_Bilczewski.png",
    "canonization_date": "October 23, 2005",
    "history": "Saint Józef Bilczewski (1860–1923) was a Polish Roman Catholic archbishop of Lviv. He was known for his profound intellectual abilities, his pastoral zeal, and his dedication to the faithful during a turbulent period marked by war and political upheaval. He emphasized spiritual renewal, social charity, and the importance of education, particularly founding various Catholic institutions and promoting Catholic action among the laity.",
    "source_url": "https://en.wikipedia.org/wiki/J%C3%B3zef_Bilczewski"
  },
  "saint-gaetano-catanoso": {
    "name": "Saint Gaetano Catanoso",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/f/f2/Catanoso.jpg",
    "canonization_date": "October 23, 2005",
    "history": "Saint Gaetano Catanoso (1870–1963) was an Italian priest and the founder of the Congregation of the Sisters of Saint Veronica of the Holy Face. He dedicated his life to caring for the poor and marginalized, particularly children and the elderly. He was also known for his devotion to the Holy Face of Jesus, encouraging adoration and reparation for sins. He tirelessly worked as a parish priest, confessor, and spiritual director, always emphasizing charity and prayer.",
    "source_url": "https://en.wikipedia.org/wiki/Gaetano_Catanoso"
  },
  "saint-zygmunt-gorazdowski": {
    "name": "Saint Zygmunt Gorazdowski",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRbRurDjK6-CQspLaNovPBHlgLF5yBFPPucIA&s",
    "canonization_date": "October 23, 2005",
    "history": "Saint Zygmunt Gorazdowski (1845–1920) was a Polish priest and the founder of the Sisters of Saint Joseph of the Apparition. Despite suffering from severe tuberculosis from a young age, he dedicated his life to serving the sick, the poor, and the abandoned. He established numerous charitable institutions, including a home for the incurable, an orphanage, and a school, earning him the title 'Father of the Poor and the Sick'.",
    "source_url": "https://en.wikipedia.org/wiki/Zygmunt_Gorazdowski"
  },
  "saint-felice-da-nicosia": {
    "name": "Saint Felice da Nicosia",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/d/dd/%D0%A4%D0%B8%D0%BB%D0%B8%D0%BF%D0%BF_%D0%B8%D0%B7_%D0%9D%D0%B8%D0%BA%D0%BE%D0%B7%D0%B8%D0%B8.jpg",
    "canonization_date": "October 23, 2005",
    "history": "Saint Felice da Nicosia (born Filippo Giacomo Amoroso, 1715–1787) was a Sicilian Capuchin friar. He lived a life of extreme humility, obedience, and self-denial, serving as a simple questor (beggar) for his community. Despite being illiterate, he possessed profound spiritual wisdom and was known for his unwavering faith, prayer, and deep interior life. He patiently endured mockery and hardship, always radiating peace and devotion.",
    "source_url": "https://en.wikipedia.org/wiki/Felix_of_Nicosia"
  },
  "saint-janina-maria-szymanowska": {
    "name": "Saint Janina (Maria) Szymanowska",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRnzIF7bxyoS_90mlalU9Em_-i47_t3lwQkVw&s",
    "canonization_date": "October 23, 2005",
    "history": "Saint Janina (Maria) Szymanowska (born Maria Karłowska, 1865–1935) was a Polish religious sister and the foundress of the Congregation of the Sisters of the Good Shepherd of Divine Providence. She dedicated her life to helping prostitutes and marginalized women, providing them with refuge, rehabilitation, and spiritual guidance. Her work was marked by courageous charity and unwavering faith in the face of societal stigma, aiming to restore dignity and hope to those ostracized by society.",
    "source_url": "https://en.wikipedia.org/wiki/Maria_Kar%C5%82owska"
  }
}