{
  "saint-gaetano-errico": {
    "name": "Saint Gaetano Errico",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/0/06/Cayetano_ovalo.jpg",
    "canonization_date": "October 12, 2008",
    "history": "Saint Gaetano Errico (1791–1860) was an Italian priest and the founder of the Missionaries of the Sacred Hearts of Jesus and Mary. He dedicated his life to giving popular missions and spiritual exercises, focusing on bringing people back to God through repentance and devotion to the Sacred Hearts. He was known for his profound humility, tireless work, and deep prayer life, often experiencing visions and mystical phenomena.",
    "source_url": "https://en.wikipedia.org/wiki/Gaetano_Errico"
  },
  "saint-maria-crocifissa-di-rosa": {
    "name": "Saint Maria Crocifissa di Rosa",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSATyTe86upnUg3dzbQO-yh28n6GM5bUrlHXw&s",
    "canonization_date": "October 12, 2008",
    "history": "Saint Maria Crocifissa di Rosa (born Paola Francesca di Rosa, 1813–1855) was an Italian religious sister and the foundress of the Handmaids of Charity. She dedicated her life to caring for the sick, particularly during cholera epidemics, and for the poor and marginalized. She established hospitals and hospices, demonstrating heroic charity and self-sacrifice in the face of immense suffering and death.",
    "source_url": "https://en.wikipedia.org/wiki/Maria_Crocifissa_di_Rosa"
  },
  "saint-conrad-of-parzham": {
    "name": "Saint Conrad of Parzham",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRhPmqHam-WX-HadGvU2u7ezcxHOeugBAGP-w&s",
    "canonization_date": "October 12, 2008",
    "history": "Saint Conrad of Parzham (born Johann Birndorfer, 1818–1894) was a German Capuchin lay brother. He served for over 40 years as the porter at the Capuchin monastery in Altötting, Bavaria, which was a popular pilgrimage site. He was known for his extraordinary humility, kindness, and prayerfulness, treating every visitor with compassion and reverence. His simple life of dedicated service made him a beloved figure.",
    "source_url": "https://en.wikipedia.org/wiki/Conrad_of_Parzham"
  },
  "saint-alphonsa-of-the-immaculate-conception": {
    "name": "Saint Alphonsa of the Immaculate Conception",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTSIhKDoK1SkNv6Dzz_rKstLhMR17uJ2quAhA&s",
    "canonization_date": "October 12, 2008",
    "history": "Saint Alphonsa of the Immaculate Conception (born Anna Muttathupadathu, 1910–1946) was an Indian Syro-Malabar Franciscan Clarist nun. She was the first woman of Indian origin to be canonized as a saint by the Catholic Church. Throughout her life, she endured chronic illness and physical suffering, which she embraced as a means of spiritual purification and offering to God. She was known for her deep faith, spiritual counsel, and profound trust in divine providence.",
    "source_url": "https://en.wikipedia.org/wiki/Alphonsa_of_the_Immaculate_Conception"
  }
}