{
  "saint-jacques-berthieu": {
    "name": "Saint Jacques Berthieu",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQTV7nMSHOBZ_zmjsA7SOmFfCcaKv662qPf6Q&s",
    "canonization_date": "October 21, 2012",
    "history": "Saint Jacques Berthieu (1838–1896) was a French Jesuit priest and missionary who served in Madagascar. He dedicated over two decades to evangelizing and ministering to the Malagasy people, often facing severe persecution and difficult conditions. He was martyred during the Menalamba rebellion for refusing to renounce his faith.",
    "source_url": "https://en.wikipedia.org/wiki/Jacques_Berthieu"
  },
  "saint-pedro-calungsod": {
    "name": "Saint Pedro Calungsod",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTAkcKJ4Ut2xr-1J-NZHGbmU6eQ05wB_0C4Ig&s",
    "canonization_date": "October 21, 2012",
    "history": "Saint Pedro Calungsod (c. 1654–1672) was a young Filipino Roman Catholic catechist and missionary. He served alongside Jesuit missionaries in the Mariana Islands, where he was martyred at a young age for his faith while attempting to baptize a child. He is the second Filipino saint, revered for his steadfastness and courage.",
    "source_url": "https://en.wikipedia.org/wiki/Pedro_Calungsod"
  },
  "saint-giovanni-battista-piamarta": {
    "name": "Saint Giovanni Battista Piamarta",
    "image_url": "https://anastpaul.com/wp-content/uploads/2019/04/st-giovanni-battista-piamarta-new-saints_j8chwu.jpg?w=840",
    "canonization_date": "October 21, 2012",
    "history": "Saint Giovanni Battista Piamarta (1841–1913) was an Italian priest and the founder of the Congregation of the Holy Family of Nazareth and the Congregation of the Humble Sister Servants of the Lord. He dedicated his life to the education and vocational training of youth, especially orphans and marginalized boys, preparing them for productive lives rooted in faith and skilled labor.",
    "source_url": "https://en.wikipedia.org/wiki/Giovanni_Battista_Piamarta"
  },
  "saint-carmen-salles-y-barangueras": {
    "name": "Saint Carmen Salles y Barangueras",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSmmzXyfTwC-ioG8a3m7kjJDHtcPqFT4wvKaw&s",
    "canonization_date": "October 21, 2012",
    "history": "Saint Carmen Salles y Barangueras (1848–1911) was a Spanish religious sister and the founder of the Missionary Sisters of the Immaculate Conception. She dedicated her life to the education of women and girls, emphasizing a comprehensive formation that included spiritual, intellectual, and moral development, often catering to those in need of assistance.",
    "source_url": "https://en.wikipedia.org/wiki/Maria_del_Carmen_Sall%C3%A9s_y_Barangueras"
  },
  "saint-anna-schaffer": {
    "name": "Saint Anna Schäffer",
    "image_url": "https://missionpriest.com/wp-content/uploads/2022/06/St.-Anne-Schaffer.jpeg",
    "canonization_date": "October 21, 2012",
    "history": "Saint Anna Schäffer (1882–1925) was a German laywoman who suffered from severe and debilitating injuries due to a boiler explosion in 1901, which left her bedridden for the rest of her life. Despite her immense physical suffering, she embraced her pain as a means of participating in Christ's Passion, offering it for the conversion of sinners and the good of the Church. She became known as a 'saint of suffering' due to her profound spiritual strength and numerous attributed miracles.",
    "source_url": "https://en.wikipedia.org/wiki/Anna_Sch%C3%A4ffer"
  },
  "saint-mariana-cope": {
    "name": "Saint Mariana Cope",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS8CCpiJObcYJCl57_9tqZg1QXNAPUwMPBzlQ&s",
    "canonization_date": "October 21, 2012",
    "history": "Saint Mariana Cope (born Barbara Koob, 1838–1918) was a German-American nun and a member of the Sisters of St. Francis of Syracuse, New York. She is known for her selfless dedication to caring for marginalized individuals, particularly those suffering from Hansen's Disease (leprosy) on the island of Molokai, Hawaii. She served alongside Saint Damien of Molokai and continued his work after his death, providing medical care, comfort, and dignity to the patients.",
    "source_url": "https://en.wikipedia.org/wiki/Mariana_Cope"
  },
  "saint-kateri-tekakwitha": {
    "name": "Saint Kateri Tekakwitha",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQeIX1j9RFeBHfwU8npqII5tJDkUDZTfBayAw&s",
    "canonization_date": "October 21, 2012",
    "history": "Saint Kateri Tekakwitha (1656–1680) was a Mohawk laywoman and the first Native American to be canonized by the Catholic Church. Orphaned at a young age, she embraced Christianity despite persecution from her community. She was known for her deep piety, chastity, and devotion to the Eucharist. Her life of prayer and penitence inspired many, leading her to be revered as the 'Lily of the Mohawks'.",
    "source_url": "https://en.wikipedia.org/wiki/Kateri_Tekakwitha"
  }
}