{
  "saint-theodore-guerin": {
    "name": "Saint Théodore Guérin",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRPFG9d4A6g81NBGwDzx4PULrw7VwNVSesUQA&s",
    "canonization_date": "October 15, 2006",
    "history": "Saint Théodore Guérin (born Anne-Thérèse Guérin, 1798–1856) was a French nun who founded the Sisters of Providence of Saint Mary-of-the-Woods in Indiana, United States. She was a pioneering educator and missionary who, despite significant challenges and personal hardships, established schools and orphanages in the American frontier. She is remembered for her unwavering faith, courage, and dedication to serving the poor and educating the young.",
    "source_url": "https://en.wikipedia.org/wiki/Theodore_Guerin"
  },
  "saint-rafael-guizar-valencia": {
    "name": "Saint Rafael Guízar Valencia",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQI4u9an_EvMMUdJNaA3w-FPY7QS9VCUfGycg&s",
    "canonization_date": "October 15, 2006",
    "history": "Saint Rafael Guízar Valencia (1878–1938) was a Mexican bishop of Veracruz. During the anti-Catholic persecution in Mexico, he courageously continued his pastoral ministry in secret, disguising himself and moving from place to place to administer the sacraments. He was known for his heroic charity, his care for the poor and sick, and his unwavering defense of the Church's rights despite facing constant threats and exile.",
    "source_url": "https://en.wikipedia.org/wiki/Rafael_Gu%C3%ADzar_Valencia"
  },
  "saint-filippo-smaldone": {
    "name": "Saint Filippo Smaldone",
    "image_url": "https://anastpaul.com/wp-content/uploads/2018/06/20061015smaldone.jpg?w=840",
    "canonization_date": "October 15, 2006",
    "history": "Saint Filippo Smaldone (1848–1923) was an Italian priest and the founder of the Salesian Sisters of the Sacred Hearts. He dedicated his life to the education and spiritual care of deaf-mutes, and also established schools for the blind and abandoned children. His compassionate work provided dignity and hope to those often marginalized by society, emphasizing love, education, and spiritual formation for all.",
    "source_url": "https://en.wikipedia.org/wiki/Filippo_Smaldone"
  },
  "saint-rosa-venerini": {
    "name": "Saint Rosa Venerini",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/3/3a/Rosa_Venerini.jpg",
    "canonization_date": "October 15, 2006",
    "history": "Saint Rosa Venerini (1656–1728) was an Italian religious sister and a pioneer in the education of girls. She founded the first public schools for girls in Italy, known as the Maestre Pie Venerini (Pious Teachers Venerini). Breaking with the conventions of her time, she believed that girls, especially those from poorer families, deserved access to education to grow in faith and knowledge. Her innovative work profoundly impacted Catholic education.",
    "source_url": "https://en.wikipedia.org/wiki/Rosa_Venerini"
  }
}