{
  "saint-arcangelo-tadini": {
    "name": "Saint Arcangelo Tadini",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS1c-lIka20Db6LE2zb-Kgd_HLMUA5ro74TJw&s",
    "canonization_date": "October 11, 2009",
    "history": "Saint Arcangelo Tadini (1846–1912) was an Italian priest and the founder of the Worker Sisters of the Holy House of Nazareth. He dedicated his life to the spiritual and material well-being of factory workers, especially women, providing them with moral and religious education, healthcare, and safe housing. He also established a textile factory to offer just employment and dignified working conditions, pioneering social Catholic action in his time.",
    "source_url": "https://en.wikipedia.org/wiki/Arcangelo_Tadini"
  },
  "saint-bernardo-tolomei": {
    "name": "Saint Bernardo Tolomei",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTAql3c39s7oWTXZ34TFkLe_BcUu1EMajv-Lg&s",
    "canonization_date": "October 11, 2009",
    "history": "Saint Bernardo Tolomei (1272–1348) was an Italian Benedictine monk and the founder of the Olivetan Congregation of the Order of Saint Benedict. A nobleman who renounced his worldly life, he established a new monastic community focused on contemplative prayer, manual labor, and communal life. He is also known for his heroic charity, particularly during the Black Death, when he and many of his monks died while caring for the sick.",
    "source_url": "https://en.wikipedia.org/wiki/Bernard_Tolom%C3%A9i"
  },
  "saint-gertrude-comensoli": {
    "name": "Saint Gertrude Comensoli",
    "image_url": "https://ajpm.weebly.com/uploads/9/3/5/4/9354572/286353745.jpg",
    "canonization_date": "October 11, 2009",
    "history": "Saint Gertrude Comensoli (1847–1903) was an Italian religious sister and the foundress of the Sacramentine Sisters. She dedicated her life to the adoration of the Blessed Sacrament and the education of young girls. She emphasized the importance of Eucharistic adoration as the core of spiritual life and aimed to instill deep faith and moral values in her students through her teaching and the example of her community.",
    "source_url": "https://en.wikipedia.org/wiki/Gertrude_Comensoli"
  },
  "saint-nuno-of-saint-mary": {
    "name": "Saint Nuno of Saint Mary",
    "image_url": "https://catholiceducation.org/wp-content/uploads/people/nino1.jpg",
    "canonization_date": "October 11, 2009",
    "history": "Saint Nuno of Saint Mary (born Nuno Álvares Pereira, 1330–1431) was a Portuguese general who played a crucial role in Portugal's independence from Castile. After a distinguished military career, he became a Carmelite lay brother, living a life of extreme humility, prayer, and penance. He is considered one of the greatest military strategists in Portuguese history and a model of Christian knighthood who transitioned to profound spiritual devotion.",
    "source_url": "https://en.wikipedia.org/wiki/Nuno_%C3%81lvares_Pereira"
  }
}