{
  "saint-paul-vi": {
    "name": "Pope Saint Paul VI",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSR45E3YJWYVWeXDCKHmA0tDFegLY30dxzL-Q&s",
    "canonization_date": "October 14, 2018",
    "history": "Born Giovanni Battista Enrico Antonio Maria Montini (1897–1978), Pope Paul VI served as Pope from 1963 to 1978. He continued and concluded the Second Vatican Council, guiding the Church through the implementation of its reforms. He traveled extensively, promoting peace and dialogue, and issued significant encyclicals, including 'Humanae Vitae'. He was a key figure in the modernization of the Catholic Church.",
    "source_url": "https://en.wikipedia.org/wiki/Pope_Paul_VI"
  },
  "saint-oscar-romero": {
    "name": "Saint Óscar Romero",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQCsSigNLioHo3GqwIaJ5ogb-jPEfxWcboqLA&s",
    "canonization_date": "October 14, 2018",
    "history": "Saint Óscar Arnulfo Romero Galdámez (1917–1980) was a Salvadoran Catholic priest who served as the fourth Archbishop of San Salvador. He was known for his outspoken criticism of poverty, social injustice, assassinations, and torture amid the escalating Salvadoran Civil War. He was assassinated on March 24, 1980, while celebrating Mass, becoming a martyr for justice and faith.",
    "source_url": "https://en.wikipedia.org/wiki/%C3%93scar_Romero"
  },
  "saint-francesco-spinelli": {
    "name": "Saint Francesco Spinelli",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQmQiy1c40NUmnzqlqnT-bLWEPyBI73KLNiSA&s",
    "canonization_date": "October 14, 2018",
    "history": "Saint Francesco Spinelli (1853–1913) was an Italian priest and the co-founder of the Institute of the Adorers of the Blessed Sacrament. He dedicated his life to Eucharistic adoration and the care of the poor, especially orphaned girls. Despite facing significant financial difficulties and opposition, he remained steadfast in his devotion and mission.",
    "source_url": "https://en.wikipedia.org/wiki/Francesco_Spinelli"
  },
  "saint-vincenzo-romano": {
    "name": "Saint Vincenzo Romano",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQiUPNgSENFwfsef9JU0keJOZ4VHYlLs7vg9g&s",
    "canonization_date": "October 14, 2018",
    "history": "Saint Vincenzo Romano (1831–1890) was an Italian diocesan priest known for his pastoral dedication and tireless service to his parishioners in Torre del Greco, near Naples. He was deeply committed to the poor and the marginalized, rebuilt his church after the 1861 eruption of Mount Vesuvius, and was known for his humble and zealous ministry.",
    "source_url": "https://en.wikipedia.org/wiki/Vincenzo_Romano"
  },
  "saint-maria-caterina-kasper": {
    "name": "Saint Maria Caterina Kasper",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQj7QCPiJIS0-9P0fH-uMc9oSrPXH3in36zmQ&s",
    "canonization_date": "October 14, 2018",
    "history": "Saint Maria Caterina Kasper (1820–1898) was a German nun who founded the Poor Handmaids of Jesus Christ. She established her congregation to serve the poor, the sick, and to provide education, focusing on helping women and children. Her life was characterized by deep faith, simplicity, and practical charity, living out the Gospel message in humble service.",
    "source_url": "https://en.wikipedia.org/wiki/Maria_Caterina_Kasper"
  },
  "saint-nazaria-ignacia-march-mesa": {
    "name": "Saint Nazaria Ignacia March Mesa",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/f/f3/Santa_Nazaria_Ignacia.jpg",
    "canonization_date": "October 14, 2018",
    "history": "Saint Nazaria Ignacia March Mesa (1889–1943) was a Spanish nun who founded the Pontifical Missionary Crusaders of Mary Immaculate. She dedicated her life to evangelization, promoting the role of women in the Church, and serving the poor and marginalized, particularly in Latin America (Bolivia and Argentina). She emphasized prayer, sacrifice, and mission work.",
    "source_url": "https://en.wikipedia.org/wiki/Nazaria_Ignacia_March_Mesa"
  },
  "saint-nunzio-sulprizio": {
    "name": "Saint Nunzio Sulprizio",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSpWbRH8V1z3zigX3cOra00juDr2HbAlcZQwQ&s",
    "canonization_date": "October 14, 2018",
    "history": "Saint Nunzio Sulprizio (1817–1836) was an Italian layman who lived a short life marked by suffering from a crippling disease and poor working conditions. Despite his immense pain and poverty, he offered his sufferings to God with heroic patience and faith, becoming an inspiration for those who endure chronic illness and hardship. He is considered a patron of the disabled and victims of work-related accidents.",
    "source_url": "https://en.wikipedia.org/wiki/Nunzio_Sulprizio"
  }
}