{
  "saint-stanislaus-kazimierczyk": {
    "name": "Saint Stanislaus Kazimierczyk",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTjjDesCO6Qb1avgU1IVJ7fANP4DEgRC0EoWQ&s",
    "canonization_date": "October 17, 2010",
    "history": "Saint Stanislaus Kazimierczyk (1433–1489) was a Polish priest and a member of the Canons Regular of the Lateran. He was known for his profound devotion to the Eucharist and the Blessed Virgin Mary, as well as for his eloquent preaching, humility, and charitable works, especially towards the poor and sick. He spent his life ministering in Kraków, inspiring many through his holiness and dedication to priestly duties.",
    "source_url": "https://en.wikipedia.org/wiki/Stanislaus_Kazimierczyk"
  },
  "saint-andre-bessette": {
    "name": "Saint André Bessette",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQTGRkGeiZ1-elpIEa4Pl8PUAYUS8n4-GtQSw&s",
    "canonization_date": "October 17, 2010",
    "history": "Saint André Bessette (born Alfred Bessette, 1845–1937) was a Canadian lay brother of the Congregation of Holy Cross. Despite humble beginnings and persistent illness, he became known as the 'Miracle Man of Montreal' due to the numerous healings attributed to his intercession, especially among the sick who visited him at the Notre Dame College. He dedicated his life to caring for the infirm and promoting devotion to Saint Joseph, eventually overseeing the construction of Saint Joseph's Oratory.",
    "source_url": "https://en.wikipedia.org/wiki/Brother_Andr%C3%A9"
  },
  "saint-camilla-battista-da-varano": {
    "name": "Saint Camilla Battista da Varano",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTCbIprQxu4OuYQqVbr2UgTknave6arfMsFQ&s",
    "canonization_date": "October 17, 2010",
    "history": "Saint Camilla Battista da Varano (born Camilla da Varano, 1458–1524) was an Italian princess and Poor Clare nun. She was known for her intense mystical experiences, deep devotion to the Passion of Christ, and austere penitential life. She founded and reformed several Poor Clare monasteries and authored significant spiritual writings, contributing to the mystical tradition of the Church.",
    "source_url": "https://en.wikipedia.org/wiki/Camilla_Battista_da_Varano"
  },
  "saint-giulia-salzano": {
    "name": "Saint Giulia Salzano",
    "image_url": "https://anastpaul.com/wp-content/uploads/2019/05/giulia-salzano2.jpg?w=840",
    "canonization_date": "October 17, 2010",
    "history": "Saint Giulia Salzano (1846–1929) was an Italian nun and the foundress of the Congregation of the Catechetical Sisters of the Sacred Heart of Jesus. She dedicated her life to religious education, tirelessly teaching catechism to children and adults, especially in rural areas. She emphasized the importance of sound doctrine and devotion to the Sacred Heart as foundational for faith formation.",
    "source_url": "https://en.wikipedia.org/wiki/Giulia_Salzano"
  },
  "saint-candida-maria-de-jesus": {
    "name": "Saint Candida Maria de Jesus",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTXALrghykPFSZvvVN_CuKgejRkGrDfOMPUqQ&s",
    "canonization_date": "October 17, 2010",
    "history": "Saint Candida Maria de Jesus (born Juana Josefa Cipitria y Barriola, 1845–1912) was a Spanish religious sister and the foundress of the Daughters of Jesus. She dedicated her life to the education of girls, particularly those from disadvantaged backgrounds, believing that education was key to forming devout and responsible individuals. Her congregation spread rapidly, establishing schools that offered holistic formation rooted in Ignatian spirituality.",
    "source_url": "https://en.wikipedia.org/wiki/Candida_Maria_of_Jesus"
  },
  "saint-mary-of-the-cross-mackillop": {
    "name": "Saint Mary of the Cross MacKillop",
    "image_url": "https://brigidine.org.au/wp-content/uploads/2019/08/8340a3952fb778e94fdf23a7289f9bda.jpg",
    "canonization_date": "October 17, 2010",
    "history": "Saint Mary of the Cross MacKillop (1842–1909) was an Australian nun and the co-founder of the Sisters of St Joseph of the Sacred Heart. She is Australia's first canonized saint. She dedicated her life to providing education and care for the poor and marginalized, particularly in rural and remote areas, often facing significant opposition from ecclesiastical authorities. Her resilience, compassion, and commitment to social justice laid the foundation for Catholic education and welfare in Australia.",
    "source_url": "https://en.wikipedia.org/wiki/Mary_MacKillop"
  }
}