{
  "saint-gianna-beretta-molla": {
    "name": "Saint Gianna Beretta Molla",
    "image_url": "https://hallow.com/wp-content/uploads/2023/07/st.-gianna-beretta-nolla.png",
    "canonization_date": "May 16, 2004",
    "history": "Saint Gianna Beretta Molla (1922–1962) was an Italian pediatrician, wife, and mother. She is known for her heroic decision to forgo a medical procedure that would have saved her life but risked the life of her unborn child. She died shortly after giving birth, becoming a symbol of self-sacrifice for the sanctity of life. She lived her life dedicated to God, her family, and her medical profession, balancing deeply held faith with modern life.",
    "source_url": "https://en.wikipedia.org/wiki/Gianna_Beretta_Molla"
  },
  "saint-josep-manyanet-i-vives": {
    "name": "Saint Josep Manyanet i Vives",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/b/bb/PadreManyanetPortrait.jpg",
    "canonization_date": "May 16, 2004",
    "history": "Saint Josep Manyanet i Vives (1833–1901) was a Spanish priest and founder of the Sons of the Holy Family and the Missionary Daughters of the Holy Family of Nazareth. He dedicated his life to promoting the Christian formation of families and the education of children and youth. He emphasized the virtues of the Holy Family of Nazareth as a model for all families and for religious life.",
    "source_url": "https://en.wikipedia.org/wiki/Josep_Manyanet_i_Vives"
  },
  "saint-nimatullah-kassab-al-hardini": {
    "name": "Saint Nimatullah Kassab Al-Hardini",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/Hardini.jpg/250px-Hardini.jpg",
    "canonization_date": "May 16, 2004",
    "history": "Saint Nimatullah Kassab Al-Hardini (born Youssef Kassab, 1808–1858) was a Lebanese Maronite Catholic monk and priest. He was known for his austere ascetical life, deep spirituality, and profound devotion to the Eucharist and the Virgin Mary. He served as a spiritual director, a teacher, and a formator for novices within the Lebanese Maronite Order, emphasizing humility and obedience.",
    "source_url": "https://en.wikipedia.org/wiki/Nimatullah_Kassab_Al-Hardini"
  },
  "saint-paola-elisabetta-cerioli": {
    "name": "Saint Paola Elisabetta Cerioli",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT1m_7fNqUnJyOWRQg0CJ2hIT4t7zjSNOU2LA&s",
    "canonization_date": "May 16, 2004",
    "history": "Saint Paola Elisabetta Cerioli (born Costanza Cerioli, 1815–1865) was an Italian religious sister and the foundress of the Institute of Sisters of the Holy Family and the Congregation of Brothers of the Holy Family. After experiencing profound personal losses, she dedicated her life to caring for abandoned and orphaned children, particularly girls, providing them with education and a loving home. Her work emphasized the model of the Holy Family.",
    "source_url": "https://en.wikipedia.org/wiki/Paola_Elisabetta_Cerioli"
  },
  "saint-alberto-hurtado": {
    "name": "Saint Alberto Hurtado",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR6MZ7XlBmPNHb7L3blkHhOJXyPcfforYBQFw&s",
    "canonization_date": "October 23, 2004",
    "history": "Saint Alberto Hurtado (1901–1952) was a Chilean Jesuit priest and social worker. He founded the 'Hogar de Cristo' (Home of Christ), a shelter for the homeless, abandoned children, and the poor, which became a prominent social welfare institution in Chile. He was known for his fervent commitment to social justice, his tireless work for the disadvantaged, and his profound spirituality, often quoting 'Contento, Señor, contento!' (Content, Lord, content!).",
    "source_url": "https://en.wikipedia.org/wiki/Alberto_Hurtado"
  },
  "saint-maria-crocifissa-curcio": {
    "name": "Saint Maria Crocifissa Curcio",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/b/b4/MC_dipinto.jpg",
    "canonization_date": "May 16, 2004",
    "history": "Saint Maria Crocifissa Curcio (born Rosa Curcio, 1877–1957) was an Italian religious sister and the foundress of the Congregation of the Carmelite Missionary Sisters of Saint Therese of the Child Jesus. She dedicated her life to evangelization and missionary work, particularly through the education of children and the care of the poor in the most neglected areas. She emphasized the 'little way' of St. Thérèse of Lisieux in her missionary apostolate.",
    "source_url": "https://en.wikipedia.org/wiki/Maria_Crocifissa_Curcio"
  }
}