{
  "saint-francisco-marto": {
    "name": "Saint Francisco Marto",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQjHWJ1kSKHrEjXWY_9Twx2CWFnBvI_CkzfwA&s",
    "canonization_date": "May 13, 2017",
    "history": "Saint Francisco Marto (1908–1919) was one of the three shepherd children to whom the Virgin Mary appeared in Fátima, Portugal, in 1917. Known for his contemplative nature and devotion to prayer and reparation for sins, he contracted the Spanish flu and died at a young age, offering his suffering for the love of God. He is the youngest non-martyr to be canonized by the Catholic Church.",
    "source_url": "https://en.wikipedia.org/wiki/Francisco_Marto"
  },
  "saint-jacinta-marto": {
    "name": "Saint Jacinta Marto",
    "image_url": "https://giveninstitute.com/wp-content/uploads/2020/09/St.-Jacinta-1-e1601304252587.jpg",
    "canonization_date": "May 13, 2017",
    "history": "Saint Jacinta Marto (1910–1920) was the youngest of the three children who witnessed the Marian apparitions in Fátima, Portugal. She was known for her lively spirit, deep love for the Immaculate Heart of Mary, and fervent desire to make sacrifices for the conversion of sinners. Like her brother Francisco, she died from the Spanish flu, offering her sufferings with heroic fortitude. She is revered as a powerful intercessor, particularly for children and families.",
    "source_url": "https://en.wikipedia.org/wiki/Jacinta_Marto"
  },
  "the-martyrs-of-natal": {
    "name": "The Martyrs of Natal (André de Soveral and Companions)",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR8cyEeNR3d7ZDP_gUqN7_eooQkoaEQhn2gNQ&s",
    "canonization_date": "October 15, 2017",
    "history": "This group of 30 martyrs, including two priests, André de Soveral and Ambrósio Francisco Ferro, and 28 lay faithful, were massacred in two separate incidents in July and October 1645 in the state of Rio Grande do Norte, Brazil. They were killed by Dutch Calvinists and their indigenous allies because of their Catholic faith. Their martyrdom is a testament to their unwavering fidelity to Christ in the face of persecution. Their canonization honored their collective sacrifice for the faith.",
    "source_url": "https://en.wikipedia.org/wiki/Martyrs_of_Natal"
  }
}