{
  "saint-angela-de-la-cruz": {
    "name": "Saint Ángela de la Cruz",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c5/%C3%81ngela_de_la_Cruz.jpg/330px-%C3%81ngela_de_la_Cruz.jpg",
    "canonization_date": "May 4, 2003",
    "history": "Saint Ángela de la Cruz (born María de los Ángeles Guerrero y González, 1846–1932) was a Spanish religious sister and the foundress of the Company of the Sisters of the Cross. She dedicated her life to serving the sick, the elderly, and the poor, living a life of extreme humility and self-sacrifice. She was known for her profound charity and simple, yet radical, commitment to living among the most marginalized in Seville.",
    "source_url": "https://www.catholic.org/saints/saint.php?saint_id=7495"
  },
  "saint-maria-of-the-incarnation": {
    "name": "Saint Maria of the Incarnation (Barbe Acarie)",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/Barbe_Acarie.jpg/330px-Barbe_Acarie.jpg",
    "canonization_date": "May 10, 2003",
    "history": "Saint Maria of the Incarnation (born Barbe Acarie, 1566–1618) was a French Carmelite nun and mystic. As a laywoman, she was instrumental in introducing the Discalced Carmelite nuns to France. After raising her six children, she entered the Carmelites as a lay sister after her husband's death. She was known for her deep interior prayer, mystical experiences, and profound spiritual wisdom, serving as a guide to many prominent figures of her time.",
    "source_url": "https://www.catholic.org/saints/saint.php?saint_id=7496"
  },
  "saint-david-galvan-bermudez": {
    "name": "Saint David Galván Bermúdez",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/David_Galv%C3%A1n_Berm%C3%BAdez_1882-1915.jpg/330px-David_Galv%C3%A1n_Berm%C3%BAdez_1882-1915.jpg",
    "canonization_date": "May 18, 2003",
    "history": "Saint David Galván Bermúdez (1882–1915) was a Mexican priest and martyr. During the persecution of the Church in Mexico, he was arrested and executed for refusing to deny his priestly vocation. He taught at the seminary and was known for his dedication to the formation of future priests. He faced his death with courage, demonstrating unwavering fidelity to Christ and the Church.",
    "source_url": "https://www.catholic.org/saints/saint.php?saint_id=7504"
  },
  "saint-genoveva-torres-morales": {
    "name": "Saint Genoveva Torres Morales",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Genoveva_Torres_Morales.jpg/330px-Genoveva_Torres_Morales.jpg",
    "canonization_date": "May 18, 2003",
    "history": "Saint Genoveva Torres Morales (1870–1956) was a Spanish religious sister and the foundress of the Congregation of the Sisters of the Sacred Heart of Jesus and of the Holy Angels (Angelicas). Despite being physically disabled from a young age, she dedicated her life to caring for elderly women who lived alone, providing them with comfort, community, and spiritual support. Her life was a testament to courage, perseverance, and profound charity.",
    "source_url": "https://www.catholic.org/saints/saint.php?saint_id=7505"
  },
  "saint-maria-maravillas-de-jesus": {
    "name": "Saint María Maravillas de Jesús",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/36/Maria_Maravillas_de_Jesus.jpg/330px-Maria_Maravillas_de_Jesus.jpg",
    "canonization_date": "May 18, 2003",
    "history": "Saint María Maravillas de Jesús (born María de las Maravillas Pidal y Chico de Guzmán, 1891–1974) was a Spanish Discalced Carmelite nun. She founded numerous Carmelite monasteries throughout Spain and beyond, seeking to re-establish the primitive Carmelite observance. She was known for her intense prayer life, deep humility, and profound love for the Eucharist, often facing persecution and hardships during the Spanish Civil War.",
    "source_url": "https://www.catholic.org/saints/saint.php?saint_id=7506"
  },
  "saint-pedro-poveda-castroverde": {
    "name": "Saint Pedro Poveda Castroverde",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Pedro_Poveda.jpg/330px-Pedro_Poveda.jpg",
    "canonization_date": "May 18, 2003",
    "history": "Saint Pedro Poveda Castroverde (1874–1936) was a Spanish priest and founder of the Teresian Association, a secular institute dedicated to Christian education and the promotion of human values. He was a pioneer in advocating for the education of women and lay participation in the Church. He was martyred during the Spanish Civil War, shot for his faith and his educational apostolate, becoming a symbol of Christian commitment to social and intellectual development.",
    "source_url": "https://www.catholic.org/saints/saint.php?saint_id=7507"
  },
  "saint-ursula-ledochowska": {
    "name": "Saint Ursula Ledóchowska",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/Urszula_Led%C3%B3chowska.jpg/330px-Urszula_Led%C3%B3chowska.jpg",
    "canonization_date": "May 18, 2003",
    "history": "Saint Ursula Ledóchowska (born Julia Maria Ledóchowska, 1865–1939) was a Polish religious sister and the foundress of the Ursulines of the Agonizing Heart of Jesus (Grey Ursulines). She dedicated her life to the education and spiritual formation of children and youth, particularly those in need. She worked extensively in various European countries, adapting to local cultures and tirelessly spreading the message of Christ through education and charitable works.",
    "source_url": "https://www.catholic.org/saints/saint.php?saint_id=7508"
  }
}