{
  "saint-jeanne-emilie-de-villeneuve": {
    "name": "Saint Jeanne Émilie de Villeneuve",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcStEPA34IiFMR3bLYCJxdd-0DrYdb4N8ZlIIw&s",
    "canonization_date": "May 17, 2015",
    "history": "Saint Jeanne Émilie de Villeneuve (1811–1854) was a French religious sister and the founder of the Sisters of Our Lady of the Immaculate Conception of Castres. She dedicated her life to serving the poor, the sick, and those in need, particularly focusing on educating and caring for abandoned children and offering help to women in prisons. Her congregation was founded with the aim of 'doing the will of God in all things' through charity and humility.",
    "source_url": "https://en.wikipedia.org/wiki/Jeanne_%C3%89milie_de_Villeneuve"
  },
  "saint-maria-cristina-of-the-immaculate-conception": {
    "name": "Saint Maria Cristina of the Immaculate Conception",
    "image_url": "https://images.findagrave.com/photos/2022/233/25013309_67ae49a2-c491-4081-9f26-4cac1f16724d.jpeg",
    "canonization_date": "May 17, 2015",
    "history": "Saint Maria Cristina of the Immaculate Conception (born Adelaide Brando, 1856–1906) was an Italian religious sister and the foundress of the Congregation of the Sisters Expiatory Victims of Jesus in the Blessed Sacrament. She devoted her life to the adoration of the Eucharist and to the education and spiritual formation of young girls, particularly the poor and abandoned. She emphasized prayer, sacrifice, and a deep love for Christ present in the Blessed Sacrament.",
    "source_url": "https://en.wikipedia.org/wiki/Maria_Cristina_of_the_Immaculate_Conception"
  },
  "saint-mariam-baouardy": {
    "name": "Saint Mariam Baouardy",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSG6sLZvEjf881MXaciLFYL7QBJE38dB-FeyQ&s",
    "canonization_date": "May 17, 2015",
    "history": "Saint Mariam Baouardy (also known as Mary of Jesus Crucified, 1846–1878) was a Discalced Carmelite nun of the Melkite Greek Catholic Church, born in Galilee (Ottoman Syria, present-day Palestine). She experienced profound mystical graces, including ecstasies, stigmata, and bilocation. Known for her humility and simplicity, she founded Carmelite convents in Bethlehem and Nazareth and is a powerful intercessor for peace in the Middle East.",
    "source_url": "https://en.wikipedia.org/wiki/Mariam_Baouardy"
  },
  "saint-louis-martin": {
    "name": "Saint Louis Martin",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/3/38/Louis_Martin_1.jpg",
    "canonization_date": "October 18, 2015",
    "history": "Saint Louis Martin (1823–1894) was a French watchmaker and the father of Saint Thérèse of Lisieux. Along with his wife, Saint Zélie Martin, he created a deeply devout Catholic home environment that fostered the spiritual growth of their five daughters who became nuns, including the Doctor of the Church, St. Thérèse. He is recognized for his exemplary Christian family life, faith, and patience in suffering.",
    "source_url": "https://en.wikipedia.org/wiki/Louis_Martin_(saint)"
  },
  "saint-marie-azelie-guerin-martin": {
    "name": "Saint Marie-Azélie Guérin Martin (Zélie Martin)",
    "image_url": "https://giveninstitute.com/wp-content/uploads/2018/08/Given-Institute-Inspiring-Women-Saint-St-Zelie-Guerin-Martin.jpg",
    "canonization_date": "October 18, 2015",
    "history": "Saint Marie-Azélie Guérin Martin (1831–1877), known as Zélie Martin, was a French lacemaker and the mother of Saint Thérèse of Lisieux. Together with her husband, Saint Louis Martin, she lived an extraordinary ordinary life, combining professional work with deep faith and dedicated parenting. She is known for her strong character, entrepreneurial spirit, and profound trust in God amidst numerous family trials, including the loss of several children.",
    "source_url": "https://en.wikipedia.org/wiki/Marie-Az%C3%A9lie_Gu%C3%A9rin_Martin"
  },
  "saint-junipero-serra": {
    "name": "Saint Junípero Serra",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRCeoG9Z4a0P_PyHzZOz4TQtIwv6yo_WlEddQ&s",
    "canonization_date": "September 23, 2015",
    "history": "Saint Junípero Serra (1713–1784) was a Spanish Franciscan friar who founded nine Catholic missions in Alta California (modern-day California) during the Spanish colonial period. He dedicated his life to evangelizing the native peoples of the region, introducing them to Christianity and European agricultural methods. He is a controversial figure due to the complex historical context of the missions and their impact on indigenous populations, but is revered by the Church for his missionary zeal.",
    "source_url": "https://en.wikipedia.org/wiki/Jun%C3%ADpero_Serra"
  }
}