{
  "saint-titus-brandsma": {
    "name": "Saint Titus Brandsma",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRuNDpoH5oAU2YlRegRd2VMV3rfQHRM70E10w&s",
    "canonization_date": "May 15, 2022",
    "history": "Saint Titus Brandsma (1881–1942) was a Dutch Carmelite friar, professor of philosophy, and journalist. He was an outspoken critic of Nazism and was arrested by the Nazis for his resistance activities, particularly for defending the Catholic press against Nazi propaganda. He was martyred in the Dachau concentration camp, dying as a witness to faith and freedom of the press.",
    "source_url": "https://en.wikipedia.org/wiki/Titus_Brandsma"
  },
  "saint-devasahayam-pillai": {
    "name": "Saint Devasahayam Pillai",
    "image_url": "https://archives.vsktelangana.org/wp-content/uploads/2022/05/devasahayam-pilai-223.jpg",
    "canonization_date": "May 15, 2022",
    "history": "Saint Devasahayam Pillai (1712–1752), born Neelakandan Pillai, was an Indian layman who converted to Catholicism from Hinduism in the 18th century. He was martyred for his faith in Travancore (modern-day Kerala, India) after facing persecution from the local authorities due to his conversion. He is the first Indian layman to be canonized as a saint.",
    "source_url": "https://en.wikipedia.org/wiki/Devasahayam_Pillai"
  },
  "saint-cesar-de-bus": {
    "name": "Saint Cesar de Bus",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRrRbK6nxiOtX9J0ct9n9dzsROaU0om8BGnWQ&s",
    "canonization_date": "May 15, 2022",
    "history": "Saint Cesar de Bus (1544–1607) was a French priest who founded the Congregation of the Fathers of Christian Doctrine (Doctrinarians). He dedicated his life to catechetical instruction, especially for children and the poor, and sought to revive Christian life and knowledge of the faith in the wake of the Protestant Reformation. He was known for his fervent preaching and commitment to Christian education.",
    "source_url": "https://en.wikipedia.org/wiki/Cesar_de_Bus"
  },
  "saint-luigi-maria-palazzolo": {
    "name": "Saint Luigi Maria Palazzolo",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQLrWWk6BF263639FZdGReJhw7SzKRdNEBApw&s",
    "canonization_date": "May 15, 2022",
    "history": "Saint Luigi Maria Palazzolo (1827–1886) was an Italian priest who founded the Institute of the Sisters of the Poor (Palazzolo Institute). He dedicated his life to caring for and educating orphaned and abandoned children, particularly girls, and assisting the poor and sick in Bergamo, Italy. His work emphasized charity, humility, and complete trust in divine providence.",
    "source_url": "https://en.wikipedia.org/wiki/Luigi_Maria_Palazzolo"
  },
  "saint-giustino-maria-russolillo": {
    "name": "Saint Giustino Maria Russolillo",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSDH35KHx5teNGJd40W45ljkGVGWOld9BDWnw&s",
    "canonization_date": "May 15, 2022",
    "history": "Saint Giustino Maria Russolillo (1891–1955) was an Italian priest who founded the Society of Divine Vocations (Vocations Fathers) and the Sisters of Divine Vocations. He dedicated his life to fostering and discerning vocations to the priesthood and religious life, especially among the poor and less fortunate, believing that holiness could flourish in any walk of life.",
    "source_url": "https://en.wikipedia.org/wiki/Giustino_Maria_Russolillo"
  },
  "saint-charles-de-foucauld": {
    "name": "Saint Charles de Foucauld",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTcviwU4MI1KIApMSVeucrKJSya4HrSbRKOmg&s",
    "canonization_date": "May 15, 2022",
    "history": "Saint Charles de Foucauld (1858–1916) was a French cavalry officer, explorer, geographer, and later a Trappist monk and hermit in the Sahara Desert. After a period of spiritual searching, he dedicated his life to a contemplative, hidden life among the Tuareg people in Algeria, living in poverty and humility. His spirituality, known as the 'spirituality of Nazareth,' has inspired several religious congregations.",
    "source_url": "https://en.wikipedia.org/wiki/Charles_de_Foucauld"
  },
  "saint-maria-francesca-of-jesus": {
    "name": "Saint Maria Francesca of Jesus (Anna Maria Rubatto)",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQNgYqi0zpbGbVX2OoAeY2krUufIwV721qCg&s",
    "canonization_date": "May 15, 2022",
    "history": "Saint Maria Francesca of Jesus (born Anna Maria Rubatto, 1844–1904) was an Italian religious sister who founded the Capuchin Sisters of Mother Rubatto in Uruguay, becoming the first saint from Uruguay. She dedicated her life to serving the poor, the sick, and marginalized, working with great charity and humility, especially in the Americas where her congregation expanded rapidly.",
    "source_url": "https://en.wikipedia.org/wiki/Anna_Maria_Rubatto"
  },
  "saint-maria-domenica-mantovani": {
    "name": "Saint Maria Domenica Mantovani",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT7fuZaNzoaheHSk_07hAIzC_Tymq32MDjdcg&s",
    "canonization_date": "May 15, 2022",
    "history": "Saint Maria Domenica Mantovani (1862–1934) was an Italian religious sister and the co-founder of the Institute of the Little Sisters of the Holy Family. She collaborated closely with Blessed Giuseppe Nascimbeni to establish a congregation dedicated to family spirituality, catechesis, and serving the needy, especially the sick and the poor in their homes.",
    "source_url": "https://en.wikipedia.org/wiki/Maria_Domenica_Mantovani"
  },
  "saint-maria-of-jesus-carolina-santocanale": {
    "name": "Saint Maria of Jesus (Carolina Santocanale)",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRgHsI9Uly1dV8XoDwkkhGPZuhgkMfjfYmD7A&s",
    "canonization_date": "May 15, 2022",
    "history": "Saint Maria of Jesus (born Carolina Santocanale, 1852–1923) was an Italian religious sister who founded the Capuchin Sisters of Immaculate Mary of Lourdes. She dedicated her life to caring for the poor, the sick, and orphaned children in Palermo, Sicily. She opened schools and homes for the needy, living a life of deep prayer and service, inspired by the Franciscan charism.",
    "source_url": "https://en.wikipedia.org/wiki/Maria_of_Jesus_(Santocanale)"
  },
  "saint-marie-rivier": {
    "name": "Saint Marie Rivier",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTE-6jNXDhZh0dgrFKlmGdIs_WUGwE8s98dEA&s",
    "canonization_date": "May 15, 2022",
    "history": "Saint Marie Rivier (1768–1838) was a French religious sister who founded the Congregation of the Sisters of the Presentation of Mary. Despite suffering from physical disabilities from childhood, she dedicated her life to the education of girls and the evangelization of the poor, especially during the French Revolution when religious education was suppressed. She bravely established schools and maintained religious life in secret.",
    "source_url": "https://en.wikipedia.org/wiki/Marie_Rivier"
  }
}