{
  "saint-luigi-scrosoppi": {
    "name": "Saint Luigi Scrosoppi",
    "image_url": "https://www.saintforaminute.com/_next/image?url=https%3A%2F%2Fijalnpjougkchzxbgvec.supabase.co%2Fstorage%2Fv1%2Fobject%2Fpublic%2Fsaints-images%2Fsaint_luigi_scrosoppi_of_udine.jpg&w=3840&q=75",
    "canonization_date": "June 10, 2001",
    "history": "Saint Luigi Scrosoppi (1804–1884) was an Italian priest who dedicated his life to the care and education of abandoned girls. He founded the Sisters of Providence of Saint Cajetan of Thiene, an order devoted to serving the poor, the sick, and orphans. He was known for his deep trust in Divine Providence and his tireless efforts in establishing orphanages and schools.",
    "source_url": "https://en.wikipedia.org/wiki/Luigi_Scrosoppi"
  },
  "saint-agostino-roscelli": {
    "name": "Saint Agostino Roscelli",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSriszkGh0c14GJvq8_SIcvP49VQFUtm7LJ1Q&s",
    "canonization_date": "June 10, 2001",
    "history": "Saint Agostino Roscelli (1818–1902) was an Italian priest who founded the Institute of Sisters of the Immaculata. He dedicated his life to serving marginalized women and children, particularly working girls, by providing them with education, vocational training, and spiritual guidance. He spent long hours in the confessional, known for his deep concern for the youth and those at risk.",
    "source_url": "https://en.wikipedia.org/wiki/Agostino_Roscelli"
  },
  "saint-bernard-of-corleone": {
    "name": "Saint Bernard of Corleone",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/a/ae/Fortunat_Bergant_-_Sv._Bernard_Korleonski.jpg",
    "canonization_date": "June 10, 2001",
    "history": "Saint Bernard of Corleone (born Filippo Latini, 1605–1667) was a Sicilian Capuchin friar. Before his conversion, he was a skilled swordsman known for his violent temper. After accidentally wounding an opponent in a duel, he sought refuge with the Capuchins and underwent a profound spiritual transformation. He lived a life of extreme penance, humility, and service, embodying a radical shift from violence to Christ-like gentleness.",
    "source_url": "https://en.wikipedia.org/wiki/Bernard_of_Corleone"
  },
  "saint-ignazia-verzeri": {
    "name": "Saint Ignazia Verzeri",
    "image_url": "https://images.findagrave.com/photos/2022/238/25737654_5b01d0a8-8451-4c83-958f-df0ce83c759c.jpeg",
    "canonization_date": "June 10, 2001",
    "history": "Saint Ignazia Verzeri (1801–1852) was an Italian religious sister and the foundress of the Daughters of the Sacred Heart of Jesus. She committed her life to the education and Christian formation of young women, especially those in need. Despite facing significant challenges and opposition, she tirelessly worked to establish schools and foster the spiritual and intellectual growth of her students.",
    "source_url": "https://en.wikipedia.org/wiki/Ignazia_Verzeri"
  },
  "saint-rafqa-pietra-choboq-ar-rayes": {
    "name": "Saint Rafqa Pietra Choboq Ar-Rayès",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/64/Sainte_Rafqa.jpg/960px-Sainte_Rafqa.jpg",
    "canonization_date": "June 10, 2001",
    "history": "Saint Rafqa Pietra Choboq Ar-Rayès (1832–1914) was a Lebanese Maronite nun. Born Boutrossieh Choboq Ar-Rayès, she experienced immense physical suffering throughout her adult life, including blindness and paralysis, which she offered up to God for the salvation of souls. She lived a life of profound prayer, patience, and silent sacrifice, becoming a powerful example of enduring faith amidst affliction.",
    "source_url": "https://en.wikipedia.org/wiki/Rafqa_Pietra_Choboq_Ar-Ray%C3%A8s"
  },
  "saint-joseph-marello": {
    "name": "Saint Joseph Marello",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ4ZxxHenQKPQl1tcbbO5o_gwPjQSc-oYL14A&s",
    "canonization_date": "November 25, 2001",
    "history": "Saint Joseph Marello (1844–1895) was an Italian bishop and the founder of the Oblates of Saint Joseph. He was known for his pastoral zeal, his dedication to the poor and needy, and his efforts in catechesis and education. He emphasized the virtues of St. Joseph and sought to foster a deep spiritual life among his priests and the faithful.",
    "source_url": "https://en.wikipedia.org/wiki/Joseph_Marello"
  },
  "saint-paula-montal-fornes": {
    "name": "Saint Paula Montal Fornés",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTroFCnxcv-6-h0BmBTDnFPz8zq2kTox_oFwCUeLZPf5ysYwk65IxmvUUCdGbrowcHet_0&usqp=CAU",
    "canonization_date": "November 25, 2001",
    "history": "Saint Paula Montal Fornés (1799–1889) was a Spanish religious sister and the foundress of the Sisters of the Pious Schools (Escolapias). A pioneer in women's education, she dedicated her life to providing Catholic education for girls, especially in a time when it was not widely available. She believed that educating women was crucial for the Christian transformation of society.",
    "source_url": "https://en.wikipedia.org/wiki/Paula_Montal_Forn%C3%A9s"
  },
  "saint-maria-crescentia-hoss": {
    "name": "Saint Maria Crescentia Höss",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRDcb6K5Ey0MvBrj409ATbK65Jz1-ax9PniKg&s",
    "canonization_date": "November 25, 2001",
    "history": "Saint Maria Crescentia Höss (1682–1744) was a German Franciscan Tertiary nun. Despite facing initial rejection and mistreatment from some of her community members, she lived a life of profound humility, obedience, and intense prayer. She was eventually entrusted with important roles, including mistress of novices and superior, and became known for her spiritual wisdom and prophetic insights.",
    "source_url": "https://en.wikipedia.org/wiki/Maria_Crescentia_H%C3%B6ss"
  },
  "saint-leonie-aviat": {
    "name": "Saint Leonie Aviat",
    "image_url": "https://angelusnews.com/wp-content/uploads/2020/01/Mother_Franc%CC%A7oise_de_Sales_Aviat-1.jpg",
    "canonization_date": "November 25, 2001",
    "history": "Saint Leonie Aviat (1844–1914) was a French religious sister and the co-foundress, with Father Louis Brisson, of the Oblate Sisters of St. Francis de Sales. She dedicated her life to the education and evangelization of young working-class girls, establishing schools and workshops that provided both moral and vocational training. Her work emphasized blending faith with daily life and work.",
    "source_url": "https://en.wikipedia.org/wiki/L%C3%A9onie_Aviat"
  }
}