{
  "saint-antonio-of-santanna-galvao": {
    "name": "Saint Antonio of Sant'Anna Galvão",
    "image_url": "https://cdn.conventodapenha.org.br/wp-content/uploads/2018/10/04150731/Frei-Galv%C3%A3o.jpg",
    "canonization_date": "May 11, 2007",
    "history": "Saint Antonio of Sant'Anna Galvão (born Antônio de Sant'Anna Galvão, 1739–1822) was a Brazilian Franciscan friar. He is the first Brazilian-born saint. He was known for his intense devotion to the Immaculate Conception, his spiritual guidance, and his compassion for the sick. He is particularly famous for his 'pills of Frei Galvão', small paper pills with a Gospel verse, believed to have brought about numerous healings.",
    "source_url": "https://en.wikipedia.org/wiki/Antonio_of_Sant%27Anna_Galv%C3%A3o"
  },
  "saint-maria-bernarda-butler": {
    "name": "Saint Maria Bernarda Bütler",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRbYm9kqRAKl1ldcm4LsUcmEHzlfs54wLWSPg&s",
    "canonization_date": "October 21, 2007",
    "history": "Saint Maria Bernarda Bütler (born Verena Bütler, 1848–1924) was a Swiss Roman Catholic religious sister who founded the Franciscan Missionary Sisters of Mary Help of Sinners (later renamed Franciscan Missionary Sisters of Our Lady of Perpetual Help). She led her congregation to Ecuador and later Colombia, where she dedicated her life to missionary work, caring for the poor, the sick, and indigenous populations amidst challenging conditions.",
    "source_url": "https://en.wikipedia.org/wiki/Maria_Bernarda_B%C3%BCtler"
  },
  "saint-anna-schaffer": {
    "name": "Saint Anna Schäffer",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/8/8b/Anna_Sch%C3%A4ffer.jpg",
    "canonization_date": "October 21, 2007",
    "history": "Saint Anna Schäffer (1882–1925) was a German laywoman. She experienced a severe accident that left her bedridden and in constant pain for the rest of her life. Despite her immense suffering, she accepted her condition with extraordinary patience and spiritual fortitude, offering her pain for the salvation of souls. She became known as a 'suffering apostle' and attracted numerous pilgrims seeking her prayers and spiritual advice.",
    "source_url": "https://en.wikipedia.org/wiki/Anna_Sch%C3%A4ffer"
  }
}