{
  "saint-alonso-de-orozco-mena": {
    "name": "Saint Alonso de Orozco Mena",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQCR2be3xUVPz2OulnIq0fLYjJEQBOAlxpoPQ&s",
    "canonization_date": "May 19, 2002",
    "history": "Saint Alonso de Orozco Mena (1500–1591) was a Spanish Augustinian priest, mystic, and writer. Born into a noble family, he initially pursued a legal career before entering the Augustinian Order. He was known for his intense spiritual life, his dedication to the poor and prisoners, and his prolific mystical writings. He served as a royal preacher and confessor, always maintaining a spirit of humility and detachment from worldly honors. His writings greatly influenced Spanish spirituality.",
    "source_url": "https://en.wikipedia.org/wiki/Alonso_de_Orozco"
  },
  "saint-ignatius-of-santhia": {
    "name": "Saint Ignatius of Santhià",
    "image_url": "https://i0.wp.com/findthesaint.com/wp-content/uploads/2023/02/St-Ignatius-of-Santhia-September-22.jpg?resize=357%2C472&ssl=1",
    "canonization_date": "May 19, 2002",
    "history": "Saint Ignatius of Santhià (born Lorenzo Maurizio Belvisotti, 1686–1770) was an Italian Capuchin friar. He joined the Capuchin Order after serving in the military. He was known for his life of austere penance, deep prayer, and dedicated service as a confessor and spiritual director. He often worked in the infirmary, caring for the sick with great compassion and humility. He was a popular figure in Turin, revered for his holiness.",
    "source_url": "https://en.wikipedia.org/wiki/Ignatius_of_Santhi%C3%A0"
  },
  "saint-humilis-of-bisignano": {
    "name": "Saint Humilis of Bisignano",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQGbdOwImmYR63AC6rNs3beMyUYLQ1GxiH2Og&s",
    "canonization_date": "May 19, 2002",
    "history": "Saint Humilis of Bisignano (born Luca Antonio Pirozzo, 1582–1637) was an Italian Franciscan friar. He was a simple, uneducated man who joined the Order of Friars Minor. Known for his profound humility, obedience, and childlike innocence, he lived a life of prayer and service. He was said to have had mystical experiences and visions, and was revered by both common people and the nobility for his spiritual wisdom.",
    "source_url": "https://en.wikipedia.org/wiki/Humilis_of_Bisignano"
  },
  "saint-benedetta-cambiagio-frassinello": {
    "name": "Saint Benedetta Cambiagio Frassinello",
    "image_url": "https://uscatholic.org/wp-content/uploads/2022/07/Santa_Benedetta_Cambiagio_Frassinello_1791-1858.jpeg",
    "canonization_date": "May 19, 2002",
    "history": "Saint Benedetta Cambiagio Frassinello (1791–1858) was an Italian wife, mother, and later, the foundress of the Congregation of the Benedictine Sisters of Providence. After facing personal tragedies and a profound spiritual calling, she dedicated her life to God's service, particularly the education of girls. She founded her congregation to provide spiritual and intellectual formation for young women, overcoming significant obstacles with faith and determination.",
    "source_url": "https://en.wikipedia.org/wiki/Benedetta_Cambiagio_Frassinello"
  },
  "saint-paulina-of-the-agonizing-heart-of-jesus": {
    "name": "Saint Paulina of the Agonizing Heart of Jesus",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/Santa_Paolina.jpg/1200px-Santa_Paolina.jpg",
    "canonization_date": "May 19, 2002",
    "history": "Saint Paulina of the Agonizing Heart of Jesus (born Amabile Lucia Visintainer, 1865–1942) was an Italian-born Brazilian religious sister and the foundress of the Congregation of the Little Sisters of the Immaculate Conception. She immigrated to Brazil with her family and, as a young woman, dedicated herself to caring for the sick and abandoned. She is considered the first Brazilian saint, renowned for her charity, humility, and steadfast faith amidst adversity.",
    "source_url": "https://en.wikipedia.org/wiki/Paulina_of_the_Agonizing_Heart_of_Jesus"
  },
  "saint-pio-of-pietrelcina": {
    "name": "Saint Pio of Pietrelcina (Padre Pio)",
    "image_url": "https://www.vatican.va/news_services/liturgy/2002/img/20020616_padre-pio.jpg",
    "canonization_date": "June 16, 2002",
    "history": "Saint Pio of Pietrelcina (born Francesco Forgione, 1887–1968), popularly known as Padre Pio, was an Italian Capuchin friar, priest, and mystic. He became famous for bearing the stigmata (wounds of Christ) for fifty years. He was also known for his spiritual direction, gift of healing, bilocation, prophecy, and intense prayer life. Millions venerate him for his devotion to God and his compassionate ministry to souls through the confessional.",
    "source_url": "https://en.wikipedia.org/wiki/Padre_Pio"
  },
  "saint-peter-of-saint-joseph-betancur": {
    "name": "Saint Peter of Saint Joseph Betancur",
    "image_url": "https://static.wixstatic.com/media/910b61_78759fb0b48a4449a885153ffbea78f6~mv2.jpg/v1/fill/w_263,h_375,al_c,lg_1,q_80/910b61_78759fb0b48a4449a885153ffbea78f6~mv2.jpg",
    "canonization_date": "July 30, 2002",
    "history": "Saint Peter of Saint Joseph Betancur (1626–1667) was a Spanish-born missionary and social worker in Guatemala, considered the first saint of the Canary Islands. He founded the Order of Our Lady of Bethlehem (Bethlehemites) to care for the poor, sick, and homeless, and to educate indigenous children. He was known for his radical dedication to charity, his austere personal life, and his unwavering commitment to the most marginalized in society.",
    "source_url": "https://en.wikipedia.org/wiki/Peter_of_Saint_Joseph_Betancur"
  },
  "saint-juan-diego-cuauhtlatoatzin": {
    "name": "Saint Juan Diego Cuauhtlatoatzin",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ca/Juan-Diego.jpg/250px-Juan-Diego.jpg",
    "canonization_date": "July 31, 2002",
    "history": "Saint Juan Diego Cuauhtlatoatzin (1474–1548) was an indigenous Chichimec peasant and visionary from Mexico. He is famous for the apparitions of Our Lady of Guadalupe in 1531, which led to the construction of a church on Tepeyac Hill and the rapid conversion of millions of indigenous people to Catholicism. His tilma (cloak) miraculously bears the image of the Virgin Mary, a revered icon in the Americas.",
    "source_url": "https://en.wikipedia.org/wiki/Juan_Diego_Cuauhtlatoatzin"
  },
  "saint-josemaria-escriva": {
    "name": "Saint Josemaría Escrivá",
    "image_url": "https://cdn.britannica.com/46/139846-004-E9B2E4C8/St-Josemaria-Escriva-de-Balaguer.jpg",
    "canonization_date": "October 6, 2002",
    "history": "Saint Josemaría Escrivá (1902–1975) was a Spanish Catholic priest and the founder of Opus Dei, an institution of the Catholic Church whose aim is to help people find holiness in their work and daily lives. He emphasized that ordinary life and work are paths to sanctity and that all baptized Christians are called to holiness. His teachings promoted the universal call to holiness and the sanctification of ordinary life.",
    "source_url": "https://en.wikipedia.org/wiki/Josemar%C3%ADa_Escriv%C3%A1"
  }
}