{
  "saint-manuel-ruiz-and-companions": {
    "name": "Saint Manuel Ruiz and Seven Companions",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ7PSrXGIE4hNpT1S3VeIRkuMdGrOuW9TAR8w&s",
    "canonization_date": "October 20, 2024",
    "history": "Saint Manuel Ruiz (1804–1860) was a Franciscan priest and leader of a community in Damascus, Syria, along with seven other Franciscan friars and three Maronite laymen. They were martyred during the 1860 Damascus massacre, a period of anti-Christian violence. They chose to remain steadfast in their faith rather than convert to Islam, suffering torture and death. Their canonization recognizes their heroic witness to Christ.",
    "source_url": "https://en.wikipedia.org/wiki/Martyrs_of_Damascus"
  },
  "saint-giuseppe-allamano": {
    "name": "Saint Giuseppe Allamano",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR1lHZipvo4fSt0CPyfUTRM16vxn1jLbf_SAQ&s",
    "canonization_date": "October 20, 2024",
    "history": "Saint Giuseppe Allamano (1851–1926) was an Italian priest and the founder of the Consolata Missionaries (Institutes of the Consolata Missionaries and Consolata Missionary Sisters). He dedicated his life to missionary work, particularly in Africa, and emphasized the importance of prayer, sacrifice, and the compassionate evangelization of peoples, focusing on the Blessed Virgin Mary under the title 'Consolata'.",
    "source_url": "https://en.wikipedia.org/wiki/Giuseppe_Allamano"
  },
  "saint-marie-leonie-paradis": {
    "name": "Saint Marie-Léonie Paradis",
    "image_url": "https://www.cccb.ca/wp-content/uploads/2018/02/Marie-Leonie-Paradis-240x300.jpg",
    "canonization_date": "October 20, 2024",
    "history": "Saint Marie-Léonie Paradis (1840–1912) was a Canadian religious sister and the founder of the Little Sisters of the Holy Family. She dedicated her life to supporting the spiritual and material needs of priests, seminarians, and bishops, particularly by serving in rectories and seminaries. Her congregation lived a simple, hidden life of service, prayer, and charity, providing domestic assistance to the clergy.",
    "source_url": "https://en.wikipedia.org/wiki/Marie-L%C3%A9onie_Paradis"
  },
  "saint-elena-guerra": {
    "name": "Saint Elena Guerra",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR0bzlAFqzHYjJ08kzQmJv0jOCqNcnxns7oMA&s",
    "canonization_date": "October 20, 2024",
    "history": "Saint Elena Guerra (1845–1914) was an Italian religious sister and the founder of the Oblate Sisters of the Holy Spirit (also known as the Sisters of Saint Zita). She was a pioneer in promoting devotion to the Holy Spirit, urging Catholics to rediscover the presence and action of the Third Person of the Trinity in their lives. She dedicated her life to education and evangelization, especially for young girls.",
    "source_url": "https://en.wikipedia.org/wiki/Elena_Guerra"
  }
}