{
  "saint-guido-maria-conforti": {
    "name": "Saint Guido Maria Conforti",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR_1aqrqtuSI5mdpi8ChpuFVJaeDASwFqMGGA&s",
    "canonization_date": "October 23, 2011",
    "history": "Saint Guido Maria Conforti (1865–1931) was an Italian archbishop and the founder of the Xaverian Missionaries (Pious Society of St. Francis Xavier for Foreign Missions). Despite fragile health throughout his life, he was driven by a deep missionary zeal. He dedicated himself to fostering vocations and sending missionaries to proclaim the Gospel in distant lands, particularly in China, where he initially hoped to serve.",
    "source_url": "https://en.wikipedia.org/wiki/Guido_Maria_Conforti"
  },
  "saint-luigi-guanella": {
    "name": "Saint Luigi Guanella",
    "image_url": "https://anastpaul.com/wp-content/uploads/2018/10/bl-luigi-header.jpg",
    "canonization_date": "October 23, 2011",
    "history": "Saint Luigi Guanella (1842–1915) was an Italian priest and the founder of the Servants of Charity (male branch) and the Daughters of Saint Mary of Providence (female branch). He dedicated his life to serving the poor, the elderly, and those with disabilities, establishing numerous homes, schools, and hospitals. He was particularly renowned for his compassionate care for the 'least of these' and for his focus on divine providence.",
    "source_url": "https://en.wikipedia.org/wiki/Luigi_Guanella"
  },
  "saint-bonifacia-rodriguez-castro": {
    "name": "Saint Bonifacia Rodriguez Castro",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTJkdmMmiSzUXXaXNDNyZp-9NXVsfiXnSkcPQ&s",
    "canonization_date": "October 23, 2011",
    "history": "Saint Bonifacia Rodriguez Castro (1837–1905) was a Spanish religious sister and the founder of the Siervas de San José (Servants of Saint Joseph). She dedicated her life to helping working women and girls, providing them with education, vocational training, and a safe, dignified work environment. Her congregation focused on combining manual labor with prayer, reflecting the spirit of Saint Joseph, and promoting the dignity of women in the workplace.",
    "source_url": "https://en.wikipedia.org/wiki/Bonifacia_Rodr%C3%ADguez_Castro"
  }
}